# 默写 TCP UDP 文件夹中的代码
# 完成一个上传和下载文件的小程序
    # server端 :根据客户端需求自定义
    # client端
        # 客户端启动之后
        # 选择 上传操作 还是 下载操作
        # 如果是上传操作 :  输入要上传的文件路径
                # 基础需求 :直接将文件上传到默认目录
                # 进阶需求 :将文件上传到指定目录
        # 如果是下载文件 : 输入要下载的文件路径
                # 基础需求 : 直接将文件下载到当前目录
                # 进阶需求 :将文件下载到指定目录
# 字符串
# 文件  -  读文件 转码 写文件
# 默写 TCP UDP 文件夹中的代码
# 完成一个上传和下载文件的小程序
    # server端 :根据客户端需求自定义
    # client端
        # 客户端启动之后
        # 选择 上传操作 还是 下载操作
        # 如果是上传操作 :  输入要上传的文件路径
                # 基础需求 :直接将文件上传到默认目录
                # 进阶需求 :将文件上传到指定目录
        # 如果是下载文件 : 输入要下载的文件路径
                # 基础需求 : 直接将文件下载到当前目录
                # 进阶需求 :将文件下载到指定目录
# 字符串
# 文件  -  读文件 转码 写文件
# 默写 TCP UDP 文件夹中的代码
# 完成一个上传和下载文件的小程序
    # server端 :根据客户端需求自定义
    # client端
        # 客户端启动之后
        # 选择 上传操作 还是 下载操作
        # 如果是上传操作 :  输入要上传的文件路径
                # 基础需求 :直接将文件上传到默认目录
                # 进阶需求 :将文件上传到指定目录
        # 如果是下载文件 : 输入要下载的文件路径
                # 基础需求 : 直接将文件下载到当前目录
                # 进阶需求 :将文件下载到指定目录
# 字符串
# 文件  -  读文件 转码 写文件
# 默写 TCP UDP 文件夹中的代码
# 完成一个上传和下载文件的小程序
    # server端 :根据客户端需求自定义
    # client端
        # 客户端启动之后
        # 选择 上传操作 还是 下载操作
        # 如果是上传操作 :  输入要上传的文件路径
                # 基础需求 :直接将文件上传到默认目录
                # 进阶需求 :将文件上传到指定目录
        # 如果是下载文件 : 输入要下载的文件路径
                # 基础需求 : 直接将文件下载到当前目录
                # 进阶需求 :将文件下载到指定目录
# 字符串
# 文件  -  读文件 转码 写文件